///// 1차포폴 JS //////
$(function () { //////jQb//////////////////////////////////////////////

    $("html,body").delay(1500).animate({
        scrollTop: "0"
    }, 100);


    // 인트로 액션을 위한 준비
    // 1. 처음에 안보였다가 나타나기
    $(".mtxt").css({
            opacity: 0
        })
        .delay(2000)
        .fadeTo(1000, 1);

    // 가운데 점으로변하기 애니
    $(".plus").eq(0)
        .delay(3000)
        .animate({
            height: "20px",
            width: "20px",
            top: "77px",
            left: "40px",
            backgroundColor: "#000"
        }, 400);

    // 마지막 플러스 기호 애니
    $(".plus").eq(1)
        .delay(3000)
        .animate({
            width: "80px",
            left: "150px"
        }, 400);


    // 앞의 글자 오른쪽 이동
    $(".mtxt:eq(0),.mtxt:eq(1)")
        .animate({
            left: "95px"
        }, 400);

    // 뒤의 글자 왼쪽이동
    $(".mtxt:eq(3),.mtxt:eq(4),.mtxt:eq(5)")
        .animate({
            left: "-180px"
        }, 400);

    // 애니메이션 후 페이지자체를 높이값 없애기 애니
    $(".intro").delay(5000)
        .animate({
            height: "0"
        }, 1000, function () {
            //애니후 삭제
            $(this).remove();
        }); //// animate ////




    //////// 우선 배너 자동이동만 합니다 /////
    var banSld = $("#slide");
    var banGo = function () {

        setInterval(function () {
            banSld.animate({
                left: "-100%"
            }, 1000, function () {
                banSld.append(banSld.find("li").first())
                    .css({
                        left: "0"
                    });
            }); // animate ////
        }, 3000);
    }; ////////// banGo ////////////////////

    // 6초후 배너 최초호출
    setTimeout(banGo, 6000);



    ///////////////////////////////베스트 셀러 슬라이드//////////////////////////////////////

    // 갤러리 이미지 이동 대상: 갤러리박스(.best_list)
    var tg = $(".best_list");


    /*////////////////////////////////////////////////////////////////
        함수명: goSlide
        기능: 슬라이드 방향별 이동
    */ ///////////////////////////////////////////////////////////////
    // 광클금지 변수/////////////////////////
    var sprot = 0; //0=허용, 1=금지
    ///////////////////////////////////////

    var goSlide = function (dir) {

        console.log("광클금지상태:" + sprot);

        //광클금지 설정////////
        if (sprot === 1) return false;
        sprot = 1; //잠금
        setTimeout(function () { // 시간을 주면 안에 있는 함수가 1번만 실행됨
            sprot = 0; //0.4초 후 해제!
        }, 400); ///타임아웃/////////////////
        /////////////////////////////////

        //dir-방향(0=왼쪽, 1=오른쪽)
        //console.log("이동방향:" + dir);


        //오른쪽 전달값이 1이므로 true
        if (dir) {
            //맨앞이미지 선택
            var first = tg.find("li").first();

            //맨앞이미지 맨뒤로 이동
            tg.append(first);
        } /////////if////////////////

        //왼쪽 전달값이 0이므로 false (else로 처리)
        else {
            //맨뒤이미지 선택
            var last = tg.find("li").last();

            //맨뒤이미지 맨앞으로 이동
            tg.prepend(last);
        } ////////else///////////////

    }; /////////////goSlide//////////////////////////////////////////
    ////////////////////////////////////////////////////////////////


    //오른쪽 버튼 클릭시 갤러리박스 맨 앞이미지 맨 뒤로 이동
    $(".rb").click(function (e) {
        e.preventDefault();
        console.log("오른쪽!");

        //슬라이드 이동함수 호출
        goSlide(1); //오른쪽 전달값은 1

    }); ////////////////click///////////////////////////


    //완쪽 버튼 클릭시 갤러리박스 맨 뒤이미지 맨 앞으로 이동
    $(".lb").click(function (e) {
        e.preventDefault();
        console.log("왼쪽!");

        //슬라이드 이동함수 호출
        goSlide(0); //왼쪽 전달값은 0

    }); ////////////////click///////////////////////////



}); /////////////////jQb/////////////////////////////////////////////
////////////////////////////////////////////////////////////////////

$(function () { /////// jQB ///////////////////////
    console.log("로딩완료2!");

    ///////////////////////////////베스트 셀러 슬라이드//////////////////////////////////////

    // 갤러리 이미지 이동 대상: 갤러리박스(.best_list)
    var tg = $(".instar_ul");


    /*////////////////////////////////////////////////////////////////
        함수명: goSlide
        기능: 슬라이드 방향별 이동
    */ ///////////////////////////////////////////////////////////////
    // 광클금지 변수/////////////////////////
    var sprot = 0; //0=허용, 1=금지
    ///////////////////////////////////////

    var goSlide = function (dir) {

        console.log("광클금지상태:" + sprot);

        //광클금지 설정////////
        if (sprot === 1) return false;
        sprot = 1; //잠금
        setTimeout(function () { // 시간을 주면 안에 있는 함수가 1번만 실행됨
            sprot = 0; //0.4초 후 해제!
        }, 400); ///타임아웃/////////////////
        /////////////////////////////////

        //dir-방향(0=왼쪽, 1=오른쪽)
        //console.log("이동방향:" + dir);


        //오른쪽 전달값이 1이므로 true
        if (dir) {

            tg.animate({
                left: "-20%"
            }, 400, function () {
                //맨앞이미지 선택
                var first = tg.find("li").first();

                //맨앞이미지 맨뒤로 이동
                tg.append(first)
                //left값 초기화
                .css({left:"0"});
                
                
            });

        } /////////if////////////////

        //왼쪽 전달값이 0이므로 false (else로 처리)
        else {
            //맨뒤이미지 선택
            var last = tg.find("li").last();

            //맨뒤이미지 맨앞으로 이동
            tg.prepend(last)
            //left값 하나만큼 공간만들기(-20%)
            .css({left:"-20%"})
            //애니메이션 들어오기
            .animate({left:"0"},400);
            
            
            
        } ////////else///////////////

    }; /////////////goSlide//////////////////////////////////////////
    ////////////////////////////////////////////////////////////////


    //오른쪽 버튼 클릭시 갤러리박스 맨 앞이미지 맨 뒤로 이동
    $(".ins_rb").click(function (e) {
        e.preventDefault();
        console.log("오른쪽!");

        //슬라이드 이동함수 호출
        goSlide(1); //오른쪽 전달값은 1

    }); ////////////////click///////////////////////////


    //완쪽 버튼 클릭시 갤러리박스 맨 뒤이미지 맨 앞으로 이동
    $(".ins_lb").click(function (e) {
        e.preventDefault();
        console.log("왼쪽!");

        //슬라이드 이동함수 호출
        goSlide(0); //왼쪽 전달값은 0

    }); ////////////////click///////////////////////////


}); ////////// jQB ///////////////////////////////
/////////////////////////////////////////////////



$(function () { /////// jQB ///////////////////////
    console.log("로딩완료2!");

    ///////////////////////////////베스트 셀러 슬라이드//////////////////////////////////////

    // 갤러리 이미지 이동 대상: 갤러리박스(.best_list)
    var tg = $(".youtube_ul");


    /*////////////////////////////////////////////////////////////////
        함수명: goSlide
        기능: 슬라이드 방향별 이동
    */ ///////////////////////////////////////////////////////////////
    // 광클금지 변수/////////////////////////
    var sprot = 0; //0=허용, 1=금지
    ///////////////////////////////////////

    var goSlide = function (dir) {

        console.log("광클금지상태:" + sprot);

        //광클금지 설정////////
        if (sprot === 1) return false;
        sprot = 1; //잠금
        setTimeout(function () { // 시간을 주면 안에 있는 함수가 1번만 실행됨
            sprot = 0; //0.4초 후 해제!
        }, 400); ///타임아웃/////////////////
        /////////////////////////////////

        //dir-방향(0=왼쪽, 1=오른쪽)
        //console.log("이동방향:" + dir);


        //오른쪽 전달값이 1이므로 true
        if (dir) {

            tg.animate({
                left: "-20%"
            }, 400, function () {
                //맨앞이미지 선택
                var first = tg.find("li").first();

                //맨앞이미지 맨뒤로 이동
                tg.append(first)
                //left값 초기화
                .css({left:"0"});
                
                
            });

        } /////////if////////////////

        //왼쪽 전달값이 0이므로 false (else로 처리)
        else {
            //맨뒤이미지 선택
            var last = tg.find("li").last();

            //맨뒤이미지 맨앞으로 이동
            tg.prepend(last)
            //left값 하나만큼 공간만들기(-20%)
            .css({left:"-20%"})
            //애니메이션 들어오기
            .animate({left:"0"},400);
            
            
            
        } ////////else///////////////

    }; /////////////goSlide//////////////////////////////////////////
    ////////////////////////////////////////////////////////////////


    //오른쪽 버튼 클릭시 갤러리박스 맨 앞이미지 맨 뒤로 이동
    $(".you_rb").click(function (e) {
        e.preventDefault();
        console.log("오른쪽!");

        //슬라이드 이동함수 호출
        goSlide(1); //오른쪽 전달값은 1

    }); ////////////////click///////////////////////////


    //완쪽 버튼 클릭시 갤러리박스 맨 뒤이미지 맨 앞으로 이동
    $(".you_lb").click(function (e) {
        e.preventDefault();
        console.log("왼쪽!");

        //슬라이드 이동함수 호출
        goSlide(0); //왼쪽 전달값은 0

    }); ////////////////click///////////////////////////
    
    


}); ////////// jQB ///////////////////////////////
/////////////////////////////////////////////////
